import numpy as np


def generate_random_seq():
    return ", ".join([f"{np.random.random():.2f}" for _ in range(10)])


print(f"不设置随机种子时，每次运行生成的序列都是不同的: {generate_random_seq()}")

np.random.seed(32)

print(f"设置随机种子后，每次运行都会生成相同的序列: {generate_random_seq()}")

# 第一次运行结果
# 不设置随机种子时，每次运行生成的序列都是不同的: 0.11, 0.98, 0.96, 0.29, 0.80, 0.21, 0.49, 0.36, 0.41, 0.64
# 设置随机种子后，每次运行都会生成相同的序列: 0.86, 0.37, 0.56, 0.96, 0.74, 0.82, 0.10, 0.93, 0.61, 0.60

# 第二次运行结果
# 不设置随机种子时，每次运行生成的序列都是不同的: 0.19, 0.32, 0.09, 0.94, 0.03, 0.04, 0.32, 0.19, 0.10, 0.64
# 设置随机种子后，每次运行都会生成相同的序列: 0.86, 0.37, 0.56, 0.96, 0.74, 0.82, 0.10, 0.93, 0.61, 0.60
