import os
import random


def generate_random_seq():
    return ", ".join([f"{random.random():.2f}" for _ in range(10)])


print(f"不设置随机种子时，每次运行生成的序列都是不同的: {generate_random_seq()}")

seed = 32
random.seed(seed)

print(f"设置随机种子后，每次运行都会生成相同的序列: {generate_random_seq()}")

# 第一次运行结果
# 不设置随机种子时，每次运行生成的序列都是不同的: 0.66, 0.21, 0.71, 0.37, 0.17, 0.85, 0.29, 0.66, 0.36, 0.68
# 设置随机种子后，每次运行都会生成相同的序列: 0.08, 0.21, 0.30, 0.90, 0.50, 0.72, 0.10, 0.51, 0.84, 0.52

# 第二次运行结果
# 不设置随机种子时，每次运行生成的序列都是不同的: 0.26, 0.33, 0.47, 0.53, 0.13, 0.03, 0.49, 0.99, 0.11, 0.43
# 设置随机种子后，每次运行都会生成相同的序列: 0.08, 0.21, 0.30, 0.90, 0.50, 0.72, 0.10, 0.51, 0.84, 0.52
